## PART I

##### 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [34]:
#Done!
import env
import pandas as pd
import numpy as np

##### 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

In [35]:
#Done!

##### 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [36]:
def get_db_url(user,host,password,schema):
    return f'mysql+pymysql://{user}:{password}@{host}/{schema}'

##### 4. Use your function to obtain a connection to the employees database.

In [85]:
conn = get_db_url(env.user, env.host, env.password, 'employees')

##### 5. Once you have successfully run a query:

In [38]:
q1 = '''
    SELECT
        first_name,
        last_name,
        emp_no
    FROM employees
    ORDER BY last_name
    LIMIT 10
'''

In [39]:
df = pd.read_sql(q1, conn)
df

  first_name last_name  emp_no
0     Bartek    Aamodt   11761
1     Aluzio    Aamodt   15427
2     Dekang    Aamodt   18182
3       Matt    Aamodt   16572
4    Mokhtar    Aamodt   12791
5  Sreenivas    Aamodt   12516
6     Sachem    Aamodt   12982
7      Basim    Aamodt   17400
8      Vidar    Aamodt   19898
9   Takanari    Aamodt   17885

##### 5.a. Intentionally make a typo in the database url. What kind of error message do you see?

In [40]:
#used 'empoyees' instead of 'employees' 
#returns (1044, "Access denied for user to database 'empoyees'")

##### 5.b. Intentionally make an error in your SQL query. What does the error message look like?

In [41]:
#used ORDERBY instead of ORDER BY
#returns (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'last_name\n    LIMIT 10' at line 6")

##### 6. Read the employees and titles tables into two separate DataFrames.

In [42]:
emps = '''
    SELECT *
    FROM employees
'''

titles = '''
    SELECT *
    FROM titles
'''

In [43]:
emps_df = pd.read_sql(emps, conn)
titles_df = pd.read_sql(titles, conn)

##### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [44]:
emps_df.shape

(300024, 6)

In [45]:
titles_df.shape

(443308, 4)

##### 8. Display the summary statistics for each DataFrame.

In [46]:
emps_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [47]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

##### 9. How many unique titles are in the titles DataFrame?

In [48]:
len(titles_df.title.unique())

7

##### 10. What is the oldest date in the to_date column?

In [49]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

##### 11. What is the most recent date in the to_date column?

In [50]:
titles_df['to_date'].max()

datetime.date(9999, 1, 1)

## PART II

##### 1. Copy the users and roles DataFrames from the examples above.

In [51]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [52]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

##### 2. What is the result of using a right join on the DataFrames?

In [53]:
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

##### 3. What is the result of using an outer join on the DataFrames?

In [54]:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

##### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [55]:
u2 = users.drop(columns='role_id')
u2.merge(roles, left_on='id', right_on='id', how='outer')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

##### 5. Load the mpg dataset from PyDataset.

In [56]:
from pydataset import data
mpg = data('mpg')

##### 6. Output and read the documentation for the mpg dataset.

In [57]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

##### 7. How many rows and columns are in the dataset?

In [58]:
mpg.shape

(234, 11)

##### 8. Check out your column names and perform any cleanup you may want on them.

In [59]:
mpg = mpg.rename(columns={'cty' : 'city', 'hwy': 'highway', 'trans': 'transmission'})
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

##### 9. Display the summary statistics for the dataset.

In [60]:
mpg.describe()

            displ         year         cyl        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

##### 10. How many different manufacturers are there?

In [61]:
len(mpg.manufacturer.unique())

15

##### 11. How many different models are there?

In [62]:
len(mpg.model.unique())

38

##### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [63]:
mpg['mileage_difference'] = mpg.highway - mpg.city
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

##### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [64]:
mpg['avg_mileage'] = (mpg.highway+mpg.city)/2
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference,avg_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

##### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [65]:
mpg['is_automatic'] = mpg.transmission.str.contains('auto')
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference,avg_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

##### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [66]:
mpg[mpg.avg_mileage == mpg.avg_mileage.max()]

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference,avg_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False

##### 16. Do automatic or manual cars have better miles per gallon?

In [67]:
mpg.groupby('is_automatic').avg_mileage.mean()

is_automatic
False    22.227273
True     19.130573
Name: avg_mileage, dtype: float64

## PART III

##### 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [68]:
user = env.user
password = env.password
host = env.host
schema = 'chipotle'
conn = f'mysql+pymysql://{user}:{password}@{host}/{schema}'

##### 2. What is the total price for each order?

In [69]:
orders = '''
    SELECT *
    FROM orders
'''

In [70]:
chip = pd.read_sql(orders, conn)

In [71]:
chip.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [72]:
chip["item_price"]= chip.item_price.str.strip('$').astype('float')

In [73]:
chip.groupby('order_id').item_price.agg(['sum'])

            sum
order_id
1         11.56
2         16.98
3         12.67
4         21.00
5         13.70
...         ...
1830      23.00
1831      12.90
1832      13.20
1833      23.50
1834      28.75

[1834 rows x 1 columns]

##### 3. What are the most popular 3 items?

In [74]:
chip.groupby('item_name').quantity.agg('sum').sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

##### 4. Which item has produced the most revenue?

In [75]:
chip['bill'] = (chip.quantity)*chip.item_price

In [76]:
chip.groupby('item_name').bill.agg('sum').sort_values(ascending=False).idxmax()

'Chicken Bowl'

##### 5. Join the employees and titles DataFrames together.

In [77]:
#emps_df and titles_df pulled in part I

In [78]:
et_df = emps_df.merge(titles_df, how='inner', on='emp_no')

In [79]:
et_df.to_csv('employees_and_titles.csv')

In [80]:
et = pd.read_csv('employees_and_titles.csv', index_col=0)

In [81]:
et.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

##### 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [82]:
et.groupby('title').from_date.agg('min')

title
Assistant Engineer    1985-02-02
Engineer              1985-02-01
Manager               1985-01-01
Senior Engineer       1985-02-01
Senior Staff          1985-01-14
Staff                 1985-02-01
Technique Leader      1985-02-02
Name: from_date, dtype: object

##### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [86]:
conn = get_db_url(env.user, env.host, env.password, 'employees')

In [87]:
deps = '''
    SELECT *
    FROM departments
    JOIN dept_emp USING(dept_no)
    JOIN titles USING(emp_no)
'''

In [88]:
deps_df = pd.read_sql(deps, conn)

In [89]:
deps_df.head()

,emp_no,dept_no,dept_name,from_date,to_date,title,from_date,to_date
0,10011,d009,Customer Service,1990-01-22,1996-11-09,Staff,1990-01-22,1996-11-09
1,10038,d009,Customer Service,1989-09-20,9999-01-01,Senior Staff,1996-09-20,9999-01-01
2,10038,d009,Customer Service,1989-09-20,9999-01-01,Staff,1989-09-20,1996-09-20
3,10049,d009,Customer Service,1992-05-04,9999-01-01,Senior Staff,2000-05-04,9999-01-01
4,10049,d009,Customer Service,1992-05-04,9999-01-01,Staff,1992-05-04,2000-05-04

In [90]:
pd.crosstab(deps_df.title, deps_df.dept_name).T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0